; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 628847 1 3 3 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	infrared2 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(have_image Planet7 image0)
	(have_image Star8 infrared2)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 star9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star9)
   goals met: 0 of 4
5. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 4
6. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 4
7. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 2 of 4
8. (turn_to satellite0 planet7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 4
9. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   goals met: 3 of 4
10. (turn_to satellite0 phenomenon10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 4
11. (take_image satellite0 phenomenon10 instrument0 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 4
